# LinkNode Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
LinkNode Class
Members See Also
---
An output node that represents a linked Revit document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class LinkNode : GroupNode
```

Visual Basic
---
```text
Public Class LinkNode _
	Inherits GroupNode
```

Visual C++
---
```text
public ref class LinkNode : public GroupNode
```

# Remarks
See also: OnLinkBegin(LinkNode).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..GroupNode Autodesk.Revit.DB..::..LinkNode
# See Also
LinkNode Members
Autodesk.Revit.DB Namespace